; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=285, out_folder=./training, instance_id=55, seed=2079, goal_proportion=0.03

(define (problem blocksworld-55)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 - object)
 (:init 
    (arm-empty)
    (clear b41)
    (on b41 b184)
    (on b184 b130)
    (on b130 b166)
    (on b166 b84)
    (on b84 b146)
    (on b146 b141)
    (on b141 b157)
    (on b157 b217)
    (on b217 b193)
    (on b193 b192)
    (on b192 b54)
    (on b54 b202)
    (on b202 b133)
    (on b133 b228)
    (on b228 b212)
    (on b212 b85)
    (on b85 b229)
    (on b229 b169)
    (on b169 b124)
    (on b124 b160)
    (on b160 b51)
    (on b51 b50)
    (on b50 b200)
    (on b200 b94)
    (on b94 b8)
    (on b8 b56)
    (on b56 b102)
    (on b102 b196)
    (on-table b196)
    (clear b53)
    (on b53 b152)
    (on b152 b9)
    (on b9 b162)
    (on b162 b136)
    (on-table b136)
    (clear b243)
    (on b243 b262)
    (on b262 b89)
    (on b89 b12)
    (on b12 b284)
    (on b284 b68)
    (on b68 b263)
    (on-table b263)
    (clear b36)
    (on b36 b35)
    (on b35 b281)
    (on b281 b190)
    (on-table b190)
    (clear b142)
    (on b142 b111)
    (on-table b111)
    (clear b224)
    (on b224 b126)
    (on-table b126)
    (clear b122)
    (on b122 b261)
    (on b261 b173)
    (on b173 b201)
    (on b201 b215)
    (on b215 b254)
    (on-table b254)
    (clear b211)
    (on-table b211)
    (clear b45)
    (on b45 b32)
    (on b32 b46)
    (on-table b46)
    (clear b206)
    (on b206 b266)
    (on b266 b230)
    (on-table b230)
    (clear b138)
    (on b138 b21)
    (on b21 b72)
    (on b72 b245)
    (on-table b245)
    (clear b76)
    (on b76 b33)
    (on b33 b218)
    (on b218 b108)
    (on-table b108)
    (clear b17)
    (on b17 b91)
    (on b91 b225)
    (on b225 b163)
    (on-table b163)
    (clear b34)
    (on-table b34)
    (clear b244)
    (on b244 b43)
    (on b43 b275)
    (on b275 b251)
    (on b251 b171)
    (on b171 b135)
    (on b135 b62)
    (on b62 b73)
    (on b73 b81)
    (on b81 b280)
    (on b280 b159)
    (on b159 b180)
    (on b180 b49)
    (on-table b49)
    (clear b233)
    (on b233 b52)
    (on b52 b105)
    (on b105 b232)
    (on b232 b129)
    (on-table b129)
    (clear b242)
    (on b242 b143)
    (on b143 b270)
    (on b270 b272)
    (on b272 b14)
    (on-table b14)
    (clear b11)
    (on b11 b4)
    (on b4 b151)
    (on-table b151)
    (clear b1)
    (on-table b1)
    (clear b140)
    (on-table b140)
    (clear b273)
    (on b273 b2)
    (on-table b2)
    (clear b147)
    (on b147 b19)
    (on b19 b139)
    (on-table b139)
    (clear b47)
    (on b47 b103)
    (on b103 b164)
    (on b164 b55)
    (on b55 b63)
    (on-table b63)
    (clear b185)
    (on b185 b144)
    (on b144 b264)
    (on b264 b271)
    (on b271 b246)
    (on b246 b58)
    (on b58 b170)
    (on b170 b223)
    (on b223 b191)
    (on b191 b187)
    (on b187 b128)
    (on-table b128)
    (clear b176)
    (on-table b176)
    (clear b134)
    (on b134 b115)
    (on b115 b155)
    (on b155 b231)
    (on b231 b238)
    (on b238 b74)
    (on b74 b252)
    (on b252 b207)
    (on b207 b168)
    (on b168 b249)
    (on b249 b10)
    (on b10 b278)
    (on b278 b265)
    (on b265 b282)
    (on b282 b77)
    (on b77 b165)
    (on b165 b24)
    (on b24 b82)
    (on b82 b210)
    (on b210 b240)
    (on b240 b156)
    (on b156 b172)
    (on b172 b178)
    (on b178 b131)
    (on b131 b182)
    (on b182 b148)
    (on b148 b113)
    (on b113 b7)
    (on-table b7)
    (clear b188)
    (on b188 b239)
    (on b239 b57)
    (on b57 b26)
    (on b26 b106)
    (on b106 b23)
    (on b23 b250)
    (on b250 b100)
    (on b100 b181)
    (on-table b181)
    (clear b283)
    (on-table b283)
    (clear b258)
    (on-table b258)
    (clear b27)
    (on-table b27)
    (clear b186)
    (on b186 b71)
    (on b71 b18)
    (on b18 b66)
    (on b66 b65)
    (on b65 b31)
    (on b31 b197)
    (on b197 b257)
    (on b257 b253)
    (on b253 b209)
    (on-table b209)
    (clear b13)
    (on b13 b104)
    (on b104 b29)
    (on-table b29)
    (clear b259)
    (on-table b259)
    (clear b203)
    (on b203 b150)
    (on b150 b95)
    (on b95 b75)
    (on-table b75)
    (clear b83)
    (on b83 b110)
    (on b110 b69)
    (on-table b69)
    (clear b107)
    (on b107 b198)
    (on-table b198)
    (clear b114)
    (on b114 b30)
    (on b30 b214)
    (on b214 b119)
    (on-table b119)
    (clear b3)
    (on-table b3)
    (clear b44)
    (on b44 b276)
    (on b276 b145)
    (on b145 b42)
    (on b42 b219)
    (on b219 b59)
    (on b59 b37)
    (on-table b37)
    (clear b154)
    (on b154 b199)
    (on-table b199)
    (clear b64)
    (on b64 b260)
    (on b260 b221)
    (on b221 b121)
    (on b121 b235)
    (on b235 b38)
    (on-table b38)
    (clear b174)
    (on-table b174)
    (clear b78)
    (on b78 b248)
    (on b248 b183)
    (on-table b183)
    (clear b22)
    (on-table b22)
    (clear b16)
    (on b16 b28)
    (on b28 b116)
    (on b116 b70)
    (on b70 b274)
    (on b274 b5)
    (on b5 b161)
    (on-table b161)
    (clear b247)
    (on b247 b15)
    (on b15 b208)
    (on b208 b79)
    (on b79 b220)
    (on b220 b158)
    (on b158 b241)
    (on-table b241)
    (clear b20)
    (on b20 b179)
    (on-table b179)
    (clear b177)
    (on b177 b61)
    (on b61 b268)
    (on b268 b204)
    (on b204 b255)
    (on b255 b88)
    (on-table b88)
    (clear b90)
    (on-table b90)
    (clear b109)
    (on b109 b189)
    (on b189 b213)
    (on-table b213)
    (clear b227)
    (on b227 b132)
    (on-table b132)
    (clear b269)
    (on b269 b137)
    (on b137 b256)
    (on b256 b195)
    (on b195 b194)
    (on b194 b277)
    (on b277 b39)
    (on b39 b48)
    (on-table b48)
    (clear b123)
    (on b123 b125)
    (on-table b125)
    (clear b117)
    (on-table b117)
    (clear b60)
    (on-table b60)
    (clear b96)
    (on-table b96)
    (clear b153)
    (on-table b153)
    (clear b226)
    (on b226 b80)
    (on b80 b237)
    (on-table b237)
    (clear b216)
    (on b216 b98)
    (on b98 b93)
    (on b93 b118)
    (on b118 b67)
    (on b67 b236)
    (on b236 b175)
    (on b175 b149)
    (on b149 b285)
    (on-table b285)
    (clear b86)
    (on b86 b279)
    (on b279 b112)
    (on-table b112)
    (clear b87)
    (on b87 b222)
    (on-table b222)
    (clear b25)
    (on-table b25)
    (clear b167)
    (on b167 b267)
    (on b267 b40)
    (on-table b40)
    (clear b97)
    (on b97 b6)
    (on b6 b120)
    (on b120 b127)
    (on b127 b205)
    (on b205 b92)
    (on b92 b99)
    (on b99 b101)
    (on-table b101)
    (clear b234)
    (on-table b234))
 (:goal  (and 
    (clear b2)
    (on b2 b8)
    (on b8 b3)
    (on b3 b5)
    (on-table b5)
    (clear b7)
    (on b7 b6)
    (on b6 b1)
    (on b1 b4)
    (on-table b4))))

; plan
1. (unstack b11 b4)
   deleted: (on b11 b4) (clear b11) (arm-empty)
   added: (holding b11) (clear b4)
   goals met: 0 of 10
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 10
3. (unstack b4 b151)
   deleted: (on b4 b151) (clear b4) (arm-empty)
   added: (holding b4) (clear b151)
   goals met: 0 of 10
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 10
5. (unstack b134 b115)
   deleted: (on b134 b115) (clear b134) (arm-empty)
   added: (holding b134) (clear b115)
   goals met: 1 of 10
6. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 1 of 10
7. (unstack b115 b155)
   deleted: (on b115 b155) (clear b115) (arm-empty)
   added: (holding b115) (clear b155)
   goals met: 1 of 10
8. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 1 of 10
9. (unstack b155 b231)
   deleted: (on b155 b231) (clear b155) (arm-empty)
   added: (holding b155) (clear b231)
   goals met: 1 of 10
10. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 1 of 10
11. (unstack b16 b28)
   deleted: (on b16 b28) (clear b16) (arm-empty)
   added: (holding b16) (clear b28)
   goals met: 1 of 10
12. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 10
13. (unstack b231 b238)
   deleted: (on b231 b238) (clear b231) (arm-empty)
   added: (holding b231) (clear b238)
   goals met: 1 of 10
14. (putdown b231)
   deleted: (holding b231)
   added: (clear b231) (arm-empty) (on-table b231)
   goals met: 1 of 10
15. (unstack b238 b74)
   deleted: (on b238 b74) (clear b238) (arm-empty)
   added: (holding b238) (clear b74)
   goals met: 1 of 10
16. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 1 of 10
17. (unstack b273 b2)
   deleted: (on b273 b2) (clear b273) (arm-empty)
   added: (holding b273) (clear b2)
   goals met: 2 of 10
18. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 2 of 10
19. (unstack b28 b116)
   deleted: (on b28 b116) (clear b28) (arm-empty)
   added: (holding b28) (clear b116)
   goals met: 2 of 10
20. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 2 of 10
21. (unstack b116 b70)
   deleted: (on b116 b70) (clear b116) (arm-empty)
   added: (holding b116) (clear b70)
   goals met: 2 of 10
22. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 2 of 10
23. (unstack b41 b184)
   deleted: (on b41 b184) (clear b41) (arm-empty)
   added: (holding b41) (clear b184)
   goals met: 2 of 10
24. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 2 of 10
25. (unstack b184 b130)
   deleted: (on b184 b130) (clear b184) (arm-empty)
   added: (holding b184) (clear b130)
   goals met: 2 of 10
26. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 2 of 10
27. (unstack b130 b166)
   deleted: (on b130 b166) (clear b130) (arm-empty)
   added: (holding b130) (clear b166)
   goals met: 2 of 10
28. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 2 of 10
29. (unstack b166 b84)
   deleted: (on b166 b84) (clear b166) (arm-empty)
   added: (holding b166) (clear b84)
   goals met: 2 of 10
30. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 2 of 10
31. (unstack b70 b274)
   deleted: (on b70 b274) (clear b70) (arm-empty)
   added: (holding b70) (clear b274)
   goals met: 2 of 10
32. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 2 of 10
33. (unstack b274 b5)
   deleted: (on b274 b5) (clear b274) (arm-empty)
   added: (holding b274) (clear b5)
   goals met: 2 of 10
34. (putdown b274)
   deleted: (holding b274)
   added: (clear b274) (arm-empty) (on-table b274)
   goals met: 2 of 10
35. (unstack b5 b161)
   deleted: (on b5 b161) (clear b5) (arm-empty)
   added: (holding b5) (clear b161)
   goals met: 2 of 10
36. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 10
37. (unstack b74 b252)
   deleted: (on b74 b252) (clear b74) (arm-empty)
   added: (holding b74) (clear b252)
   goals met: 3 of 10
38. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 3 of 10
39. (unstack b252 b207)
   deleted: (on b252 b207) (clear b252) (arm-empty)
   added: (holding b252) (clear b207)
   goals met: 3 of 10
40. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 3 of 10
41. (unstack b207 b168)
   deleted: (on b207 b168) (clear b207) (arm-empty)
   added: (holding b207) (clear b168)
   goals met: 3 of 10
42. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 3 of 10
43. (unstack b168 b249)
   deleted: (on b168 b249) (clear b168) (arm-empty)
   added: (holding b168) (clear b249)
   goals met: 3 of 10
44. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 3 of 10
45. (unstack b249 b10)
   deleted: (on b249 b10) (clear b249) (arm-empty)
   added: (holding b249) (clear b10)
   goals met: 3 of 10
46. (putdown b249)
   deleted: (holding b249)
   added: (clear b249) (arm-empty) (on-table b249)
   goals met: 3 of 10
47. (unstack b10 b278)
   deleted: (on b10 b278) (clear b10) (arm-empty)
   added: (holding b10) (clear b278)
   goals met: 3 of 10
48. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 10
49. (unstack b278 b265)
   deleted: (on b278 b265) (clear b278) (arm-empty)
   added: (holding b278) (clear b265)
   goals met: 3 of 10
50. (putdown b278)
   deleted: (holding b278)
   added: (clear b278) (arm-empty) (on-table b278)
   goals met: 3 of 10
51. (unstack b265 b282)
   deleted: (on b265 b282) (clear b265) (arm-empty)
   added: (holding b265) (clear b282)
   goals met: 3 of 10
52. (putdown b265)
   deleted: (holding b265)
   added: (clear b265) (arm-empty) (on-table b265)
   goals met: 3 of 10
53. (unstack b282 b77)
   deleted: (on b282 b77) (clear b282) (arm-empty)
   added: (holding b282) (clear b77)
   goals met: 3 of 10
54. (putdown b282)
   deleted: (holding b282)
   added: (clear b282) (arm-empty) (on-table b282)
   goals met: 3 of 10
55. (unstack b77 b165)
   deleted: (on b77 b165) (clear b77) (arm-empty)
   added: (holding b77) (clear b165)
   goals met: 3 of 10
56. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 3 of 10
57. (unstack b165 b24)
   deleted: (on b165 b24) (clear b165) (arm-empty)
   added: (holding b165) (clear b24)
   goals met: 3 of 10
58. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 3 of 10
59. (unstack b24 b82)
   deleted: (on b24 b82) (clear b24) (arm-empty)
   added: (holding b24) (clear b82)
   goals met: 3 of 10
60. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 10
61. (unstack b82 b210)
   deleted: (on b82 b210) (clear b82) (arm-empty)
   added: (holding b82) (clear b210)
   goals met: 3 of 10
62. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 3 of 10
63. (unstack b210 b240)
   deleted: (on b210 b240) (clear b210) (arm-empty)
   added: (holding b210) (clear b240)
   goals met: 3 of 10
64. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 3 of 10
65. (unstack b240 b156)
   deleted: (on b240 b156) (clear b240) (arm-empty)
   added: (holding b240) (clear b156)
   goals met: 3 of 10
66. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 3 of 10
67. (unstack b156 b172)
   deleted: (on b156 b172) (clear b156) (arm-empty)
   added: (holding b156) (clear b172)
   goals met: 3 of 10
68. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 3 of 10
69. (unstack b172 b178)
   deleted: (on b172 b178) (clear b172) (arm-empty)
   added: (holding b172) (clear b178)
   goals met: 3 of 10
70. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 3 of 10
71. (unstack b178 b131)
   deleted: (on b178 b131) (clear b178) (arm-empty)
   added: (holding b178) (clear b131)
   goals met: 3 of 10
72. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 3 of 10
73. (unstack b131 b182)
   deleted: (on b131 b182) (clear b131) (arm-empty)
   added: (holding b131) (clear b182)
   goals met: 3 of 10
74. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 3 of 10
75. (unstack b182 b148)
   deleted: (on b182 b148) (clear b182) (arm-empty)
   added: (holding b182) (clear b148)
   goals met: 3 of 10
76. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 3 of 10
77. (unstack b148 b113)
   deleted: (on b148 b113) (clear b148) (arm-empty)
   added: (holding b148) (clear b113)
   goals met: 3 of 10
78. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 3 of 10
79. (unstack b113 b7)
   deleted: (on b113 b7) (clear b113) (arm-empty)
   added: (holding b113) (clear b7)
   goals met: 4 of 10
80. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 4 of 10
81. (unstack b84 b146)
   deleted: (on b84 b146) (clear b84) (arm-empty)
   added: (holding b84) (clear b146)
   goals met: 4 of 10
82. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 4 of 10
83. (unstack b146 b141)
   deleted: (on b146 b141) (clear b146) (arm-empty)
   added: (holding b146) (clear b141)
   goals met: 4 of 10
84. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 4 of 10
85. (unstack b141 b157)
   deleted: (on b141 b157) (clear b141) (arm-empty)
   added: (holding b141) (clear b157)
   goals met: 4 of 10
86. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 4 of 10
87. (unstack b157 b217)
   deleted: (on b157 b217) (clear b157) (arm-empty)
   added: (holding b157) (clear b217)
   goals met: 4 of 10
88. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 4 of 10
89. (unstack b217 b193)
   deleted: (on b217 b193) (clear b217) (arm-empty)
   added: (holding b217) (clear b193)
   goals met: 4 of 10
90. (putdown b217)
   deleted: (holding b217)
   added: (clear b217) (arm-empty) (on-table b217)
   goals met: 4 of 10
91. (unstack b193 b192)
   deleted: (on b193 b192) (clear b193) (arm-empty)
   added: (holding b193) (clear b192)
   goals met: 4 of 10
92. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 4 of 10
93. (unstack b192 b54)
   deleted: (on b192 b54) (clear b192) (arm-empty)
   added: (holding b192) (clear b54)
   goals met: 4 of 10
94. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 4 of 10
95. (unstack b54 b202)
   deleted: (on b54 b202) (clear b54) (arm-empty)
   added: (holding b54) (clear b202)
   goals met: 4 of 10
96. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 4 of 10
97. (unstack b202 b133)
   deleted: (on b202 b133) (clear b202) (arm-empty)
   added: (holding b202) (clear b133)
   goals met: 4 of 10
98. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 4 of 10
99. (unstack b133 b228)
   deleted: (on b133 b228) (clear b133) (arm-empty)
   added: (holding b133) (clear b228)
   goals met: 4 of 10
100. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 4 of 10
101. (unstack b228 b212)
   deleted: (on b228 b212) (clear b228) (arm-empty)
   added: (holding b228) (clear b212)
   goals met: 4 of 10
102. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 4 of 10
103. (unstack b212 b85)
   deleted: (on b212 b85) (clear b212) (arm-empty)
   added: (holding b212) (clear b85)
   goals met: 4 of 10
104. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 4 of 10
105. (unstack b85 b229)
   deleted: (on b85 b229) (clear b85) (arm-empty)
   added: (holding b85) (clear b229)
   goals met: 4 of 10
106. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 4 of 10
107. (unstack b229 b169)
   deleted: (on b229 b169) (clear b229) (arm-empty)
   added: (holding b229) (clear b169)
   goals met: 4 of 10
108. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 4 of 10
109. (unstack b169 b124)
   deleted: (on b169 b124) (clear b169) (arm-empty)
   added: (holding b169) (clear b124)
   goals met: 4 of 10
110. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 4 of 10
111. (unstack b124 b160)
   deleted: (on b124 b160) (clear b124) (arm-empty)
   added: (holding b124) (clear b160)
   goals met: 4 of 10
112. (putdown b124)
   deleted: (holding b124)
   added: (clear b124) (arm-empty) (on-table b124)
   goals met: 4 of 10
113. (unstack b160 b51)
   deleted: (on b160 b51) (clear b160) (arm-empty)
   added: (holding b160) (clear b51)
   goals met: 4 of 10
114. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 4 of 10
115. (unstack b51 b50)
   deleted: (on b51 b50) (clear b51) (arm-empty)
   added: (holding b51) (clear b50)
   goals met: 4 of 10
116. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 10
117. (unstack b50 b200)
   deleted: (on b50 b200) (clear b50) (arm-empty)
   added: (holding b50) (clear b200)
   goals met: 4 of 10
118. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 4 of 10
119. (unstack b200 b94)
   deleted: (on b200 b94) (clear b200) (arm-empty)
   added: (holding b200) (clear b94)
   goals met: 4 of 10
120. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 4 of 10
121. (unstack b94 b8)
   deleted: (on b94 b8) (clear b94) (arm-empty)
   added: (holding b94) (clear b8)
   goals met: 4 of 10
122. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 4 of 10
123. (unstack b97 b6)
   deleted: (on b97 b6) (clear b97) (arm-empty)
   added: (holding b97) (clear b6)
   goals met: 4 of 10
124. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 4 of 10
125. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 4 of 10
126. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 5 of 10
127. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 10
128. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 6 of 10
129. (unstack b6 b120)
   deleted: (on b6 b120) (clear b6) (arm-empty)
   added: (holding b6) (clear b120)
   goals met: 6 of 10
130. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 10
131. (unstack b8 b56)
   deleted: (on b8 b56) (clear b8) (arm-empty)
   added: (holding b8) (clear b56)
   goals met: 7 of 10
132. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 8 of 10
133. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 10
134. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 9 of 10
135. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 10
136. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 10 of 10
